Tekla Open API Reference for Tekla Structures 2025
MaterialItem Properties
The MaterialItem type exposes the following members.
Properties
Name | Description
AliasName1
 The material item's alias name 1.
AliasName2
 The material item's alias name 2.
AliasName3
 The material item's alias name 3.
DesignCode
 The design code.
MaterialName
 The material item's name.
ModulusOfElasticity
 Thte modulus of elasticity in unit N/m2.
PlateDensity
 The plate density in unit kg/m3.
PoissonsRatio
 The poissons ratio
ProfileDensity
 The profile density in unit kg/m3.
ThermalDilatation
 The thermal dilatation in unit 1/K.
Type
 The material item's type.
Top
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace